Tekla Open API Reference for Tekla Structures 2025
PointList.Remove Method
 Removes the first occurence of the point from the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Remove(
	Point value
)
Public Sub Remove (
	value As Point
)
Parameters
value
Type: Tekla.Structures.Geometry3d.Point
The point to be removed.
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace